/** 地图一览 **/
let dictionary_map = new_map();

function new_map() {
    let map = [];
    let map_info = {};

    map[0] = [
        0,// 0-id
        "艾尔文森林",// 1-名称
        "《闪金镇惊魂》",// 2-介绍
        1,// 3-地图类型
        77,// 4-地图坐标点X
        59,// 5-地图坐标点Y
        1,// 6-最小怪物等级
        10// 7-最大怪物等级
    ];
    map[1] = [
        1,// 0-id
        "西部荒野",// 1-名称
        "《暴风城的粮仓》",// 2-介绍
        1,// 3-地图类型
        73.5,// 4-地图坐标点X
        61.0,// 5-地图坐标点Y
        10,// 6-最小怪物等级
        20// 7-最大怪物等级
    ];
    map[2] = [
        2,// 0-id
        "赤脊山",// 1-名称
        "《石后三兄弟》",// 2-介绍
        1,// 3-地图类型
        81,// 4-地图坐标点X
        61,// 5-地图坐标点Y
        15,// 6-最小怪物等级
        25// 7-最大怪物等级
    ];
    map[3] = [
        3,// 0-id
        "暮色森林",// 1-名称
        "《狼人传说》",// 2-介绍
        1,// 3-地图类型
        79,// 4-地图坐标点X
        65,// 5-地图坐标点Y
        18,// 6-最小怪物等级
        30// 7-最大怪物等级
    ];

    map[1001] = [
        1001,// 0-id
        "死亡矿井",// 1-名称
        "\"蠢货，我们的事业是正义的！\"",// 2-介绍
        5,// 3-地图类型
        71.6,// 4-地图坐标点X
        59.6,// 5-地图坐标点Y
        20,// 6-最小怪物等级
        22// 7-最大怪物等级
    ];

    map[10001] = [
        10001,// 0-id
        "卡拉赞",// 1-名称
        "\"老狗也有几颗牙！\"",// 2-介绍
        10,// 3-地图类型
        82,// 4-地图坐标点X
        67,// 5-地图坐标点Y
    ];

    map[10002] = [
        10002,// 0-id
        "奥妮克希亚的巢穴",// 1-名称
        "\"奥妮克希亚深深地吸了一口气……\"",// 2-介绍
        40,// 3-地图类型
        25,// 4-地图坐标点X
        70// 5-地图坐标点Y
    ];

    return map;
}